<template>
	<view>
		<u-navbar title="用户隐私权政策"></u-navbar>
		<view class="divider-line"></view>
		<view class="body">
			<view class="line"></view>
			<view class="line bold pag2"></view>
<!-- 			<view class="line pag2">本隐私政策将帮助您了解以下内容:</view>
			<view class="line bold">1.</view> -->

			<!-- <view class="line bold title pag">一、</view> -->
			<text>                                                 用户使用APP隐私协议
在此特别提醒您（用户）在成为用户登录系统之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。您的登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定红蚂蚁装饰股份有限公司（以下简称“红蚂蚁装饰”）与用户之间关于“红蚂蚁”（以下简称“红蚂蚁APP”）软件服务（以下简称“服务“）的权利义务。“用户”是指登录、使用本服务的个人。本协议可由红蚂蚁装饰随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用红蚂蚁提供的服务，用户继续使用服务将被视为接受修改后的协议。红蚂蚁装饰尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务。红蚂蚁装饰会按照本隐私权政策的规定使用和披露您的个人信息，除本隐私权政策另有规定外，在未征得您事先许可的情况下，红蚂蚁APP不会将这些信息对外披露或向第三方提供。
一、账号
1、用户注册后，只有通过红蚂蚁装饰验证审核后有权使用红蚂蚁APP。红蚂蚁装饰可以根据用户需求对账号登录使用权限进行变更，而无须事先通知用户，任何第三方用户不可在红蚂蚁装饰不知情情况下使用红蚂蚁APP。
2、用户在使用红蚂蚁APP的时候，同意红蚂蚁APP获取手机的部分授权信息，确保系统的正常使用，红蚂蚁APP不会获取与系统无关的授权，授权后获取与系统无关的信息。
二、红蚂蚁APP隐私信息保护
1、如果红蚂蚁装饰发现或收到他人举报或投诉用户违反本协议约定的，红蚂蚁装饰有权不经通知随时对相关内容，包括但不限于用户资料、用户录入的信息进行审查、删除，并视情节轻重对违规用户处以包括但不限于警告、用户封禁 、设备封禁 、功能封禁 的处罚，且通知用户处理结果。
2、因违反用户协议被封禁的用户，可以自行与红蚂蚁装饰联系。被封禁用户可联系红蚂蚁装饰信息技术部，将对用户的账号进行审查，并自行合理判断决定是否变更处罚措施。
3、用户理解并同意，红蚂蚁装饰有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
4、红蚂蚁装饰不允许用户或第三方以任何手段收集、编辑、出售或者传播红蚂蚁APP内的有关红蚂蚁装饰的客户相关的任何信息，如果发现从事上述活动，红蚂蚁装饰有权追究其法律责任。 
5、在您使用红蚂蚁APP的服务时，为了能保障系统的使用完整性，可能需要用户您同意授予以下权益，包括有：相机使用权（保障施工现场拍照，个人头像更换使用等），相册使用权（上传项目验收图片等），定位使用权（相机定位打卡等），手机通讯录使用权（获取公司员工通讯录便于直接联系等），麦克风使用权（便于电话通讯、语音识别等功能的使用），地图使用权（获取工地项目的位置信息）。
三、用户发布内容规范
1、本条所述内容是指用户使用服务的过程中录入、上载、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
2、用户不得利用红蚂蚁APP账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：
(1) 反对宪法所确定的基本原则的；
(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
(3) 损害国家荣誉和利益的；
(4) 煽动民族仇恨、民族歧视，破坏民族团结的；
(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
(8) 侮辱或者诽谤他人，侵害他人合法权益的；
(9) 含有法律、行政法规禁止的其他内容的信息。
3、用户不得利用红蚂蚁APP账号或本服务制作、上载、复制、发布、传播如下干扰“服务”正常运营，以及侵犯其他用户或第三方合法权益的内容：
(1) 含有任何性或性暗示的；
(2) 含有辱骂、恐吓、威胁内容的；
(3) 含有骚扰、垃圾广告、恶意信息、诱骗信息的；
(4) 涉及他人隐私、个人信息或资料的；
(5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
(6) 含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。
本《协议》版权由红蚂蚁装饰所有，红蚂蚁装饰保留一切对本《协议》解释的权利。
红蚂蚁装饰股份有限公司</text>

		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		methods: {

		}
	}
</script>

<style lang="scss">
	.body{
		padding: 30rpx;
		box-sizing: border-box;
		.line{
			line-height: 44rpx;
			font-size: 24rpx;
		}
		.pag{
			margin-top: 20rpx;
		}
		.pag2{
			margin-top: 40rpx;
		}
		.bold{
			font-weight: bold;
		}
		.bot-through{
			text-decoration: underline;
		}
		.title{
			font-size: 28rpx;
			font-weight: bold;
		}
		.link{
			color: blue;
		}
		.li{
			text-indent: 1em;
			box-sizing: border-box;
		}
		.indent2{
			text-indent: 2em;
		}
		.foot{
			padding-top: 60rpx;
			.line{
				text-align: right;
			}
		}
	}
</style>
