<template>
	<view>
		<u-navbar title="用户注册协议"></u-navbar>
		<view class="divider-line"></view>
		<!-- <view class="line header"><text>生效日期: </text></view> -->
		<view class="body">
<!-- 			<view class="line">欢迎</view>

			<view class="line pag">
				<text class="bold">在接受本协议之前</text>
			</view> -->
			<text style="font-size: 24rpx;color: #000000;">
				
				红蚂蚁注册协议
				
				
				
				
				一、特别提示
				
				
				1.本《红蚂蚁注册协议》（以下简称“本协议”）是您（以下简称“您”或“用户”）与红蚂蚁网站(网址:XX 的经营者红蚂蚁装饰股份有限公司（以下简称“红蚂蚁”）之间关于您注册并使用红蚂蚁以获得相应服务（以下简称“红蚂蚁服务”）所订立的对双方有约束力的协议。 
				 
				2.红蚂蚁已经发布的或未来可能发布的各项服务对应的服务协议、使用规则、结算规则、法律声明等，均构成本协议的组成部分，与本协议具有同等法律效力。如果本协议某一（些）条款被认定为无效，而其他条款仍能保持有效且其执行不受影响，红蚂蚁可决定是否继续履行该等其他条款。 
				 
				3.请您认真阅读本协议并充分理解本协议各条款的内容。如果您对本协议的条款有疑问的，请通过红蚂蚁网站所载的联系方式进行咨询，红蚂蚁将向您解释条款内容。一旦您按照注册页面提示填写信息、提交文件、阅读并同意本协议且完成注册后，即表示您已经充分阅读、理解并接受本协议的全部内容。如果您不同意接受本协议或其任何条款的约定或无法准确理解红蚂蚁对本协议条款的解释，您应当立即终止注册程序及在红蚂蚁网站上的任何操作。 
				 
				4.您理解并同意，红蚂蚁有权根据法律法规的变化及经营需要，不时对本协议条款进行修改并公布在红蚂蚁网站，您应在确认充分理解并同意更新后的本协议后方使用红蚂蚁服务。一旦您开始使用红蚂蚁服务，将被视为对本声明和政策内容的接受和认可。 
				 
				5.您确认，您是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织（以下简称“法律主体”）。如果您不具备前述法律主体资格，请立即终止注册程序及在红蚂蚁网站上的任何操作，且红蚂蚁有权注销您的账号。红蚂蚁因此受到损失的，将向您和/或您的监护人索赔。 
				 
				
				二、红蚂蚁账号
				
				 
				1.账号的获取 
				 
				在您按照红蚂蚁网站注册页面的提示信息填写完整注册信息、完成《红蚂蚁服务
				
				协议》的阅读、并完成账号激活操作等全部红蚂蚁注册程序后，或者红蚂蚁以其他方式向您提供红蚂蚁登录账号后，您即获得了红蚂蚁账号并正式成为红蚂蚁的用户。 
				 
				2.注册信息 
				 
				您应当保证您在注册过程中填写的信息准确、真实和完整。如果您填写的信息（包括但不限于联系地址、电话、电子邮件等）有任何变更，您应当及时登录红蚂蚁进行更新。如果红蚂蚁发现您填写的注册信息存在错误、不真实或不完整的情况， 或通过您填写的联系方式信息无法联系到您，红蚂蚁有权要求您立即进行改正、更新相关信息。 
				 
				3.实名认证 
				 
				您理解并同意，即使您获得了红蚂蚁账号亦不代表您已开通了红蚂蚁的所有服务。为保障账号及交易安全，红蚂蚁可能会随时要求您提交更多的身份资料和信息以完成账号的实名认证，只有完成账号的实名验证，您才可以使用相应的红蚂蚁服务。您授权红蚂蚁可以通过第三方查询和审核您的身份和资料。 
				 
				4.账号安全 
				 
				您应当妥善保管您的红蚂蚁账号和密码，您通过红蚂蚁账号执行的一切操作都不可撤回并将被视为是您身份及行为的唯一识别依据，您须对在该红蚂蚁账号下发生的所有活动承担责任。请您注意保护红蚂蚁账号及密码安全，并在使用完毕红蚂蚁服务后安全退出登录。除非依照法律规定或者经过红蚂蚁的同意，您不得以任何方式向任何地第三方泄露、转让或赠与您的红蚂蚁账号，否则红蚂蚁有权随时中止或终止您的账号使用，甚至注销您的账号。一旦您发现任何人未经您的授权使用您的红蚂蚁账号和密码，您应当立即通知红蚂蚁，红蚂蚁会在合理时间内采取适当措施，但对于在红蚂蚁采取措施之前发生的损失，红蚂蚁不承担责任。 
				 
				5.账号查询、冻结及注销 
				 
				您理解并同意，红蚂蚁根据合理判断，有权在下列情形下自行对您的账号进行查询（包括但不限于查询注册信息、交易信息、资金信息等）、冻结和/或注销： 
				 
				1）国家司法、行政、安全机关等权力机构要求的； 
				 
				2）您通过红蚂蚁账号的操作和交易存在违反本协议约定、法律法规和/或侵犯第三人合法权益的情形的； 
				 
				3）红蚂蚁基于单方面的合理判断，认为您的账号操作、交易记录等存在异常的； 
				 
				4）您的账号遭到其他用户投诉，且投诉用户提供一定证据予以证明的； 
				 
				
				5）您连续 12 个自然月未使用您的账号登录红蚂蚁网站，且您的账号中不存在未到期的红蚂蚁服务的； 
				 
				6）您实施了影响或侵害红蚂蚁和/或红蚂蚁关联公司的合法权益的行为，包括但不限于： 
				 
				a.违反红蚂蚁和/或红蚂蚁关联公司的服务协议、条款及规范等内容； 
				 
				b.破坏或试图破坏红蚂蚁和/或红蚂蚁关联公司公平交易环境或正常交易秩序； 
				 
				c.任何使用含有红蚂蚁和/或红蚂蚁关联公司的名称、品牌且有误导性的表述或标识，明示或暗示与红蚂蚁和/或红蚂蚁关联公司具有某种关系的； 
				 
				d.红蚂蚁认为可能是与上述行为性质相同或存在上述类似风险的其他情形。 
				 
				
				三、红蚂蚁使用规则
				
				 
				1.您在使用红蚂蚁服务的过程中，应当遵守国家、地方法律法规、行业惯例和社会公共道德。不得利用红蚂蚁进行储存、发布、传播以下信息和内容： 
				 
				1）违反国家法律法规政策的任何信息； 
				 
				2）违反国家规定的政治宣传和/或新闻信息； 
				 
				3）涉及国家秘密和/或安全的信息； 
				 
				4）封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息； 
				 
				5）博彩有奖、赌博游戏； 
				 
				6）违反国家民族和宗教政策的信息； 
				 
				7）妨碍互联网运行安全的信息； 
				 
				8）侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息。 
				 
				此外，您不得为他人发布和传播上述不符合国家规定和/或本协议约定的信息提供任何便利，包括但不限于设置 URL、BANNER 链接等。 
				 
				2.您保证不会利用技术或其他手段破坏或扰乱红蚂蚁秩序及网络安全。 
				
				 
				3.如果您使用的某项服务中包含可下载的红蚂蚁软件，则红蚂蚁仅授予您非独占性的、不可转让的、非商业性的使用许可。您不得复制、修改、发布、出售或出租服务或所含软件的任何部分，也不得进行反向工程或试图提取该软件的源代码。 
				 
				4.您应当尊重红蚂蚁及其他第三方的知识产权和其他合法权利，并保证在发生侵犯上述权益的违法事件时尽力保护红蚂蚁及其股东、雇员、合作伙伴等免于因该等事件受到影响或损失。 
				 
				5.红蚂蚁可能会以电子邮件、手机短信、电话等方式通知您服务进展情况以及提示您进行相关操作，但红蚂蚁不保证您能够收到或者及时收到该邮件、手机短信或电话等。因此，在服务过程中您应当及时登录到红蚂蚁查看和进行相关操作。因您没有及时查看和进行相关操作而导致纠纷或损失的，红蚂蚁不承担责任。 
				 
				6.您应当遵守您与红蚂蚁签订的任何书面协议的约定，包括与红蚂蚁签署的线下合作商务协议/服务协议、本协议及构成本协议组成部分的使用规则、结算规则、法律声明等。 
				 
				7.如果您通过红蚂蚁使用的某项服务来自第三方的任何产品或服务，您还可能受限于该等第三方的相关条款和条件，红蚂蚁对此不予过问亦不承担任何责任，本协议不影响您与该第三方的法律关系。 
				 
				
				四、红蚂蚁隐私政策
				
				 
				请您参见并遵守红蚂蚁网站上发布并不时更新的《红蚂蚁隐私权政策》。 
				 
				
				五、知识产权
				
				 
				除由红蚂蚁的供应商、合作伙伴或入驻红蚂蚁的第三方服务商提供的产品或服务外，红蚂蚁上的所有内容，包括但不限于著作、图片、档案、资讯、资料、架构、页面设计，均由红蚂蚁或其关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经红蚂蚁或其关联公司书面同意，您不得以任何方式或理由对上述内容进行使用、复制、修改、抄录、传播、发行或公开发表。否则，红蚂蚁有权通过法律途径依法追究您的法律责任。 
				 
				
				六、 不可抗力
				
				 
				遭受不可抗力的一方可中止履行本协议项下的义务直至不可抗力事件的影响消除为止，并且无需承担违约责任，但应尽合理努力克服该事件、减少损失的扩大。不可抗力指该方不能控制、不可预见或即使预见亦无法避免的事件，该等不可抗力事件足以妨碍、影响或延误任何一方根据本协议履行其全部或部分义务。该事件包括但不限于自然灾害、战争、政策变化造成的事件。 
				 
				
				七、责任限制
				
				 
				1.您理解并同意，您在使用红蚂蚁服务及相关网络服务过程中存在的风险将完全由您本人承担，红蚂蚁在本协议约定的责任范围以外不承担任何责任。 
				 
				2.在法律允许的情况下，红蚂蚁对于与本协议有关的任何间接的、惩罚性的、特殊的、派生的损失（包括但不限于业务损失、收益损失、利润损失、使用数据、商誉或其他经济利益的损失），不承担任何责任，即使事先已被告知此等损失的可能性。 
				 
				3.您理解并确认，对于红蚂蚁向您提供的下列服务本身及其引发的任何损失，红蚂蚁无需承担任何责任： 
				 
				1）红蚂蚁向您免费提供的各项网络服务； 
				 
				2）红蚂蚁向您赠送或附赠的任何产品或服务。 
				 
				4.您理解并确认，红蚂蚁可能因下列情况无法正常提供服务，红蚂蚁就此不承担损害赔偿责任： 
				 
				1）红蚂蚁在系统停机维护期间； 
				 
				2）电信设备出现故障不能进行数据传输； 
				 
				3）由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。 
				 
				您理解并同意，因您使用红蚂蚁服务、违反本协议或在您的账号下采取的任何行动，而导致的任何第三方索赔，应且仅应由您本人承担。如果由此引起红蚂蚁及其关联公司、员工、客户、供应商和合作伙伴被第三方索赔的，您应承担全部责任。
				
				6.您通过红蚂蚁服务访问和使用的红蚂蚁合作伙伴或入驻红蚂蚁的第三方服务商的服务质量仅为该第三方的责任，对于该第三方的服务，红蚂蚁在任何情况下都不会承担责任。
				
				
				八、适用法律与争议解决
				
				 
				 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照提交苏州市人民法院予以审理。
			</text>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		methods: {

		}
	}
</script>

<style lang="scss">
	.header{
		padding: 30rpx 30rpx 0rpx;
		box-sizing: border-box;
		color: red;
		font-size: 24rpx;
	}
	.body{
		padding: 30rpx;
		box-sizing: border-box;
		.line{
			line-height: 44rpx;
			font-size: 24rpx;
		}
		.pag{
			margin-top: 20rpx;
		}
		.pag2{
			margin-top: 40rpx;
		}
		.bold{
			font-weight: bold;
		}
		.bot-through{
			text-decoration: underline;
		}
		.title{
			font-size: 28rpx;
			font-weight: bold;
		}
		.link{
			color: blue;
		}
		.li{
			text-indent: 1em;
			box-sizing: border-box;
		}
	}
</style>
